drowe67/codec2-dev/stm32/src/sm1000_main.c
    led_pwr(1); led_ptt(0); led_rt(0); led_err(0); not_cptt(1);

    /* clear filter memories */

    for(i=0; i<FDMDV_OS_TAPS_16K; i++)
        adc16k[i] = 0.0;
    for(i=0; i<FDMDV_OS_TAPS_8K; i++)
        dac8k[i] = 0.0;

    if (!switch_back()) {
        /* Play tone to acknowledge, wait for release */
        tone_reset(&tone_gen, 1200, 1000);
        while(!switch_back()) {
            int dac_rem = dac2_free();
            if (dac_rem) {
                if (dac_rem > n_samples_16k)
                    dac_rem = n_samples_16k;

                for (i = 0; i < dac_rem; i++)
                    dac16k[i] = tone_next(&tone_gen);
                dac2_write(dac16k, dac_rem);
            }
            if (!menuLEDTicker) {
                menuLEDTicker = MENU_LED_PERIOD;
                led_rt(LED_INV);
            }
        }

        /* Button released, do an EEPROM erase */
        for (i = 0; i < PREFS_IMG_NUM; i++)
            vrom_erase(i + PREFS_IMG_BASE);
    }
    led_rt(LED_OFF);
    tone_reset(&tone_gen, 0, 0);

    /* Try to load preferences from flash */
    if (load_prefs() < 0) {
        /* Fail!  Load defaults. */
        memset(&prefs, 0, sizeof(prefs));
        prefs.op_mode = ANALOG;
        prefs.menu_vol = 2;
        prefs.menu_speed = 60;  /* 20 WPM */
        prefs.menu_freq = 800;
    }

    /* Clear out switch states */
    memset(&sw_select, 0, sizeof(sw_select));
    memset(&sw_back, 0, sizeof(sw_back));
    memset(&sw_ptt, 0, sizeof(sw_ptt));

    /* Clear out menu state */
    memset(&menu, 0, sizeof(menu));

    morse_player.freq = prefs.menu_freq;
    morse_player.dit_time = prefs.menu_speed;
    morse_player.msg = NULL;
    op_mode = prefs.op_mode;

    /* play a start-up tune. */
    sfx_play(&sfx_player, sound_startup);

    while(1) {
        /* Read switch states */
        switch_update(&sw_select,   (!switch_select()) ? 1 : 0);
        switch_update(&sw_back,     (!switch_back()) ? 1 : 0);
        switch_update(&sw_ptt,      (switch_ptt() ||
                                        (!ext_ptt())) ? 1 : 0);

        /* Process menu */
        if (!menuTicker) {
            if (menu.stack_depth > 0) {
                /* We are in a menu */
                static uint8_t press_ack = 0;
                uint8_t save_settings = 0;

                if (press_ack == 1) {
                    if ((sw_select.state == SW_STEADY)
                            && (!sw_select.sw))
                        press_ack = 0;
                } else if (press_ack == 2) {
                    if ((sw_back.state == SW_STEADY)
                            && (!sw_back.sw))
                        press_ack = 0;
                } else {
                    if (switch_pressed(&sw_select) > HOLD_DELAY) {
                        menu_exec(&menu, MENU_EVT_SELECT);
                        press_ack = 1;
                        menuTicker = MENU_DELAY;
                    } else if (switch_pressed(&sw_back) > HOLD_DELAY) {
                        menu_exec(&menu, MENU_EVT_BACK);
                        press_ack = 2;
                        menuTicker = MENU_DELAY;

                        if (!menu.stack_depth)
                            save_settings = prefs_changed;

                    } else if (switch_released(&sw_select)) {
                        menu_exec(&menu, MENU_EVT_NEXT);
                        menuTicker = MENU_DELAY;
                    } else if (switch_released(&sw_back)) {
                        menu_exec(&menu, MENU_EVT_PREV);
                        menuTicker = MENU_DELAY;
                    } else if (switch_released(&sw_ptt)) {
                        while(menu.stack_depth > 0)
                            menu_exec(&menu, MENU_EVT_EXIT);
                        sfx_play(&sfx_player, sound_returned);
                    }

                    /* If exited, put the LED back */
                    if (!menu.stack_depth) {
                        menuLEDTicker = 0;
                        menuTicker = 0;
                        led_pwr(LED_ON);
                        morse_play(&morse_player, NULL);
                        menuExit = 1;
                        if (save_settings) {
                            int oldest = -1;
                            int res;
                            /* Copy the settings in */
                            prefs.menu_freq = morse_player.freq;
                            prefs.menu_speed = morse_player.dit_time;
                            /* Increment serial number */
                            prefs.serial++;
                            /* Find the oldest image */
                            find_prefs(&oldest, NULL);
                            if (oldest < 0)
                                oldest = 0; /* No current image */

                            /* Write new settings over it */
                            res = vrom_write(oldest + PREFS_IMG_BASE, 0,
                                    sizeof(prefs), &prefs);
                            if (res >= 0)
                                prefs_serial[oldest] = prefs.serial;
                        }
                    }
                }
            } else {
                uint8_t mode_changed = 0;

                if (menuExit) {
                    /* We've just exited a menu, wait for release of BACK */
                    if (switch_released(&sw_back))
                        menuExit = 0;
                } else if (!switch_pressed(&sw_ptt) &&
                        (switch_pressed(&sw_select) > HOLD_DELAY)) {
                    /* Enter the menu */
                    led_pwr(1); led_ptt(0); led_rt(0); led_err(0); not_cptt(1);
                    menu_enter(&menu, &menu_root);
                    menuTicker = MENU_DELAY;
                    prefs_changed = 0;
                } else if (switch_released(&sw_select)) {
                    /* Shortcut: change current mode */
                    op_mode = (op_mode + 1) % MAX_MODES;
                    mode_changed = 1;
                } else if (switch_released(&sw_back)) {
                    /* Shortcut: change current mode */
                    op_mode = (op_mode - 1) % MAX_MODES;
                    mode_changed = 1;
                }

                if (mode_changed) {
                    /* Announce the new mode */
                    if (op_mode == ANALOG)
                        morse_play(&morse_player, "ANA");
                    else if (op_mode == DV)
                        morse_play(&morse_player, "1600");
                    else if (op_mode == TONE)
                        morse_play(&morse_player, "TONE");
                    sfx_play(&sfx_player, sound_click);
                }
            }
        }

        /* Acknowledge switch events */
        switch_ack(&sw_select);
        switch_ack(&sw_back);
        switch_ack(&sw_ptt);

